# 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных индексы элементы 3 и 9, ответ: 12

# my_list = [2, 4, 8, 32, 43, 21, 8]
# def if_odd(listt):
#     res = [] 
#     for i in range(len(listt)):
#         if i % 2 != 0:
#             res.append(listt[i])
#     return res
# print(f'На нечетных индексах элементы : {if_odd(my_list)}')

#








